alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4700_series/Include/XMC4700.h
/* ---------------------------------  EBU_BUSWAP3  -------------------------------- */
#define EBU_BUSWAP3_WRDTACS_Pos               (0UL)                     /*!< EBU BUSWAP3: WRDTACS (Bit 0)                                */
#define EBU_BUSWAP3_WRDTACS_Msk               (0xfUL)                   /*!< EBU BUSWAP3: WRDTACS (Bitfield-Mask: 0x0f)                  */
#define EBU_BUSWAP3_WRRECOVC_Pos              (4UL)                     /*!< EBU BUSWAP3: WRRECOVC (Bit 4)                               */
#define EBU_BUSWAP3_WRRECOVC_Msk              (0x70UL)                  /*!< EBU BUSWAP3: WRRECOVC (Bitfield-Mask: 0x07)                 */
#define EBU_BUSWAP3_WAITWRC_Pos               (7UL)                     /*!< EBU BUSWAP3: WAITWRC (Bit 7)                                */
#define EBU_BUSWAP3_WAITWRC_Msk               (0xf80UL)                 /*!< EBU BUSWAP3: WAITWRC (Bitfield-Mask: 0x1f)                  */
#define EBU_BUSWAP3_DATAC_Pos                 (12UL)                    /*!< EBU BUSWAP3: DATAC (Bit 12)                                 */
#define EBU_BUSWAP3_DATAC_Msk                 (0xf000UL)                /*!< EBU BUSWAP3: DATAC (Bitfield-Mask: 0x0f)                    */
#define EBU_BUSWAP3_EXTCLOCK_Pos              (16UL)                    /*!< EBU BUSWAP3: EXTCLOCK (Bit 16)                              */
#define EBU_BUSWAP3_EXTCLOCK_Msk              (0x30000UL)               /*!< EBU BUSWAP3: EXTCLOCK (Bitfield-Mask: 0x03)                 */
#define EBU_BUSWAP3_EXTDATA_Pos               (18UL)                    /*!< EBU BUSWAP3: EXTDATA (Bit 18)                               */
#define EBU_BUSWAP3_EXTDATA_Msk               (0xc0000UL)               /*!< EBU BUSWAP3: EXTDATA (Bitfield-Mask: 0x03)                  */
#define EBU_BUSWAP3_CMDDELAY_Pos              (20UL)                    /*!< EBU BUSWAP3: CMDDELAY (Bit 20)                              */
#define EBU_BUSWAP3_CMDDELAY_Msk              (0xf00000UL)              /*!< EBU BUSWAP3: CMDDELAY (Bitfield-Mask: 0x0f)                 */
#define EBU_BUSWAP3_AHOLDC_Pos                (24UL)                    /*!< EBU BUSWAP3: AHOLDC (Bit 24)                                */
#define EBU_BUSWAP3_AHOLDC_Msk                (0xf000000UL)             /*!< EBU BUSWAP3: AHOLDC (Bitfield-Mask: 0x0f)                   */
#define EBU_BUSWAP3_ADDRC_Pos                 (28UL)                    /*!< EBU BUSWAP3: ADDRC (Bit 28)                                 */
#define EBU_BUSWAP3_ADDRC_Msk                 (0xf0000000UL)            /*!< EBU BUSWAP3: ADDRC (Bitfield-Mask: 0x0f)                    */

/* ---------------------------------  EBU_SDRMCON  -------------------------------- */
#define EBU_SDRMCON_CRAS_Pos                  (0UL)                     /*!< EBU SDRMCON: CRAS (Bit 0)                                   */
#define EBU_SDRMCON_CRAS_Msk                  (0xfUL)                   /*!< EBU SDRMCON: CRAS (Bitfield-Mask: 0x0f)                     */
#define EBU_SDRMCON_CRFSH_Pos                 (4UL)                     /*!< EBU SDRMCON: CRFSH (Bit 4)                                  */
#define EBU_SDRMCON_CRFSH_Msk                 (0xf0UL)                  /*!< EBU SDRMCON: CRFSH (Bitfield-Mask: 0x0f)                    */
#define EBU_SDRMCON_CRSC_Pos                  (8UL)                     /*!< EBU SDRMCON: CRSC (Bit 8)                                   */
#define EBU_SDRMCON_CRSC_Msk                  (0x300UL)                 /*!< EBU SDRMCON: CRSC (Bitfield-Mask: 0x03)                     */
#define EBU_SDRMCON_CRP_Pos                   (10UL)                    /*!< EBU SDRMCON: CRP (Bit 10)                                   */
#define EBU_SDRMCON_CRP_Msk                   (0xc00UL)                 /*!< EBU SDRMCON: CRP (Bitfield-Mask: 0x03)                      */
#define EBU_SDRMCON_AWIDTH_Pos                (12UL)                    /*!< EBU SDRMCON: AWIDTH (Bit 12)                                */
#define EBU_SDRMCON_AWIDTH_Msk                (0x3000UL)                /*!< EBU SDRMCON: AWIDTH (Bitfield-Mask: 0x03)                   */
#define EBU_SDRMCON_CRCD_Pos                  (14UL)                    /*!< EBU SDRMCON: CRCD (Bit 14)                                  */
#define EBU_SDRMCON_CRCD_Msk                  (0xc000UL)                /*!< EBU SDRMCON: CRCD (Bitfield-Mask: 0x03)                     */
#define EBU_SDRMCON_CRC_Pos                   (16UL)                    /*!< EBU SDRMCON: CRC (Bit 16)                                   */
#define EBU_SDRMCON_CRC_Msk                   (0x70000UL)               /*!< EBU SDRMCON: CRC (Bitfield-Mask: 0x07)                      */
#define EBU_SDRMCON_ROWM_Pos                  (19UL)                    /*!< EBU SDRMCON: ROWM (Bit 19)                                  */
#define EBU_SDRMCON_ROWM_Msk                  (0x380000UL)              /*!< EBU SDRMCON: ROWM (Bitfield-Mask: 0x07)                     */
#define EBU_SDRMCON_BANKM_Pos                 (22UL)                    /*!< EBU SDRMCON: BANKM (Bit 22)                                 */
#define EBU_SDRMCON_BANKM_Msk                 (0x1c00000UL)             /*!< EBU SDRMCON: BANKM (Bitfield-Mask: 0x07)                    */
#define EBU_SDRMCON_CRCE_Pos                  (25UL)                    /*!< EBU SDRMCON: CRCE (Bit 25)                                  */
#define EBU_SDRMCON_CRCE_Msk                  (0xe000000UL)             /*!< EBU SDRMCON: CRCE (Bitfield-Mask: 0x07)                     */
#define EBU_SDRMCON_CLKDIS_Pos                (28UL)                    /*!< EBU SDRMCON: CLKDIS (Bit 28)                                */
#define EBU_SDRMCON_CLKDIS_Msk                (0x10000000UL)            /*!< EBU SDRMCON: CLKDIS (Bitfield-Mask: 0x01)                   */
#define EBU_SDRMCON_PWR_MODE_Pos              (29UL)                    /*!< EBU SDRMCON: PWR_MODE (Bit 29)                              */
#define EBU_SDRMCON_PWR_MODE_Msk              (0x60000000UL)            /*!< EBU SDRMCON: PWR_MODE (Bitfield-Mask: 0x03)                 */
#define EBU_SDRMCON_SDCMSEL_Pos               (31UL)                    /*!< EBU SDRMCON: SDCMSEL (Bit 31)                               */
#define EBU_SDRMCON_SDCMSEL_Msk               (0x80000000UL)            /*!< EBU SDRMCON: SDCMSEL (Bitfield-Mask: 0x01)                  */

/* ---------------------------------  EBU_SDRMOD  --------------------------------- */
#define EBU_SDRMOD_BURSTL_Pos                 (0UL)                     /*!< EBU SDRMOD: BURSTL (Bit 0)                                  */
#define EBU_SDRMOD_BURSTL_Msk                 (0x7UL)                   /*!< EBU SDRMOD: BURSTL (Bitfield-Mask: 0x07)                    */
#define EBU_SDRMOD_BTYP_Pos                   (3UL)                     /*!< EBU SDRMOD: BTYP (Bit 3)                                    */
#define EBU_SDRMOD_BTYP_Msk                   (0x8UL)                   /*!< EBU SDRMOD: BTYP (Bitfield-Mask: 0x01)                      */
#define EBU_SDRMOD_CASLAT_Pos                 (4UL)                     /*!< EBU SDRMOD: CASLAT (Bit 4)                                  */
#define EBU_SDRMOD_CASLAT_Msk                 (0x70UL)                  /*!< EBU SDRMOD: CASLAT (Bitfield-Mask: 0x07)                    */
#define EBU_SDRMOD_OPMODE_Pos                 (7UL)                     /*!< EBU SDRMOD: OPMODE (Bit 7)                                  */
#define EBU_SDRMOD_OPMODE_Msk                 (0x3f80UL)                /*!< EBU SDRMOD: OPMODE (Bitfield-Mask: 0x7f)                    */
#define EBU_SDRMOD_COLDSTART_Pos              (15UL)                    /*!< EBU SDRMOD: COLDSTART (Bit 15)                              */
#define EBU_SDRMOD_COLDSTART_Msk              (0x8000UL)                /*!< EBU SDRMOD: COLDSTART (Bitfield-Mask: 0x01)                 */
#define EBU_SDRMOD_XOPM_Pos                   (16UL)                    /*!< EBU SDRMOD: XOPM (Bit 16)                                   */
#define EBU_SDRMOD_XOPM_Msk                   (0xfff0000UL)             /*!< EBU SDRMOD: XOPM (Bitfield-Mask: 0xfff)                     */
#define EBU_SDRMOD_XBA_Pos                    (28UL)                    /*!< EBU SDRMOD: XBA (Bit 28)                                    */
#define EBU_SDRMOD_XBA_Msk                    (0xf0000000UL)            /*!< EBU SDRMOD: XBA (Bitfield-Mask: 0x0f)                       */

/* ---------------------------------  EBU_SDRMREF  -------------------------------- */
#define EBU_SDRMREF_REFRESHC_Pos              (0UL)                     /*!< EBU SDRMREF: REFRESHC (Bit 0)                               */
#define EBU_SDRMREF_REFRESHC_Msk              (0x3fUL)                  /*!< EBU SDRMREF: REFRESHC (Bitfield-Mask: 0x3f)                 */
#define EBU_SDRMREF_REFRESHR_Pos              (6UL)                     /*!< EBU SDRMREF: REFRESHR (Bit 6)                               */
#define EBU_SDRMREF_REFRESHR_Msk              (0x1c0UL)                 /*!< EBU SDRMREF: REFRESHR (Bitfield-Mask: 0x07)                 */
#define EBU_SDRMREF_SELFREXST_Pos             (9UL)                     /*!< EBU SDRMREF: SELFREXST (Bit 9)                              */
#define EBU_SDRMREF_SELFREXST_Msk             (0x200UL)                 /*!< EBU SDRMREF: SELFREXST (Bitfield-Mask: 0x01)                */
#define EBU_SDRMREF_SELFREX_Pos               (10UL)                    /*!< EBU SDRMREF: SELFREX (Bit 10)                               */
#define EBU_SDRMREF_SELFREX_Msk               (0x400UL)                 /*!< EBU SDRMREF: SELFREX (Bitfield-Mask: 0x01)                  */
#define EBU_SDRMREF_SELFRENST_Pos             (11UL)                    /*!< EBU SDRMREF: SELFRENST (Bit 11)                             */
#define EBU_SDRMREF_SELFRENST_Msk             (0x800UL)                 /*!< EBU SDRMREF: SELFRENST (Bitfield-Mask: 0x01)                */
#define EBU_SDRMREF_SELFREN_Pos               (12UL)                    /*!< EBU SDRMREF: SELFREN (Bit 12)                               */
#define EBU_SDRMREF_SELFREN_Msk               (0x1000UL)                /*!< EBU SDRMREF: SELFREN (Bitfield-Mask: 0x01)                  */
#define EBU_SDRMREF_AUTOSELFR_Pos             (13UL)                    /*!< EBU SDRMREF: AUTOSELFR (Bit 13)                             */
#define EBU_SDRMREF_AUTOSELFR_Msk             (0x2000UL)                /*!< EBU SDRMREF: AUTOSELFR (Bitfield-Mask: 0x01)                */
#define EBU_SDRMREF_ERFSHC_Pos                (14UL)                    /*!< EBU SDRMREF: ERFSHC (Bit 14)                                */
#define EBU_SDRMREF_ERFSHC_Msk                (0xc000UL)                /*!< EBU SDRMREF: ERFSHC (Bitfield-Mask: 0x03)                   */
#define EBU_SDRMREF_SELFREX_DLY_Pos           (16UL)                    /*!< EBU SDRMREF: SELFREX_DLY (Bit 16)                           */
#define EBU_SDRMREF_SELFREX_DLY_Msk           (0xff0000UL)              /*!< EBU SDRMREF: SELFREX_DLY (Bitfield-Mask: 0xff)              */
#define EBU_SDRMREF_ARFSH_Pos                 (24UL)                    /*!< EBU SDRMREF: ARFSH (Bit 24)                                 */
#define EBU_SDRMREF_ARFSH_Msk                 (0x1000000UL)             /*!< EBU SDRMREF: ARFSH (Bitfield-Mask: 0x01)                    */
#define EBU_SDRMREF_RES_DLY_Pos               (25UL)                    /*!< EBU SDRMREF: RES_DLY (Bit 25)                               */
#define EBU_SDRMREF_RES_DLY_Msk               (0xe000000UL)             /*!< EBU SDRMREF: RES_DLY (Bitfield-Mask: 0x07)                  */

/* ---------------------------------  EBU_SDRSTAT  -------------------------------- */
#define EBU_SDRSTAT_REFERR_Pos                (0UL)                     /*!< EBU SDRSTAT: REFERR (Bit 0)                                 */
#define EBU_SDRSTAT_REFERR_Msk                (0x1UL)                   /*!< EBU SDRSTAT: REFERR (Bitfield-Mask: 0x01)                   */
#define EBU_SDRSTAT_SDRMBUSY_Pos              (1UL)                     /*!< EBU SDRSTAT: SDRMBUSY (Bit 1)                               */
#define EBU_SDRSTAT_SDRMBUSY_Msk              (0x2UL)                   /*!< EBU SDRSTAT: SDRMBUSY (Bitfield-Mask: 0x01)                 */
#define EBU_SDRSTAT_SDERR_Pos                 (2UL)                     /*!< EBU SDRSTAT: SDERR (Bit 2)                                  */
#define EBU_SDRSTAT_SDERR_Msk                 (0x4UL)                   /*!< EBU SDRSTAT: SDERR (Bitfield-Mask: 0x01)                    */


/* ================================================================================ */
/* ================        struct 'ETH0_CON' Position & Mask       ================ */
/* ================================================================================ */


/* ------------------------------  ETH0_CON_ETH0_CON  ----------------------------- */
#define ETH_CON_RXD0_Pos            (0UL)                     /*!< ETH0_CON ETH0_CON: RXD0 (Bit 0)                             */
#define ETH_CON_RXD0_Msk            (0x3UL)                   /*!< ETH0_CON ETH0_CON: RXD0 (Bitfield-Mask: 0x03)               */
#define ETH_CON_RXD1_Pos            (2UL)                     /*!< ETH0_CON ETH0_CON: RXD1 (Bit 2)                             */
#define ETH_CON_RXD1_Msk            (0xcUL)                   /*!< ETH0_CON ETH0_CON: RXD1 (Bitfield-Mask: 0x03)               */
#define ETH_CON_RXD2_Pos            (4UL)                     /*!< ETH0_CON ETH0_CON: RXD2 (Bit 4)                             */
#define ETH_CON_RXD2_Msk            (0x30UL)                  /*!< ETH0_CON ETH0_CON: RXD2 (Bitfield-Mask: 0x03)               */
#define ETH_CON_RXD3_Pos            (6UL)                     /*!< ETH0_CON ETH0_CON: RXD3 (Bit 6)                             */
#define ETH_CON_RXD3_Msk            (0xc0UL)                  /*!< ETH0_CON ETH0_CON: RXD3 (Bitfield-Mask: 0x03)               */
#define ETH_CON_CLK_RMII_Pos        (8UL)                     /*!< ETH0_CON ETH0_CON: CLK_RMII (Bit 8)                         */
#define ETH_CON_CLK_RMII_Msk        (0x300UL)                 /*!< ETH0_CON ETH0_CON: CLK_RMII (Bitfield-Mask: 0x03)           */
#define ETH_CON_CRS_DV_Pos          (10UL)                    /*!< ETH0_CON ETH0_CON: CRS_DV (Bit 10)                          */
#define ETH_CON_CRS_DV_Msk          (0xc00UL)                 /*!< ETH0_CON ETH0_CON: CRS_DV (Bitfield-Mask: 0x03)             */
#define ETH_CON_CRS_Pos             (12UL)                    /*!< ETH0_CON ETH0_CON: CRS (Bit 12)                             */
#define ETH_CON_CRS_Msk             (0x3000UL)                /*!< ETH0_CON ETH0_CON: CRS (Bitfield-Mask: 0x03)                */
#define ETH_CON_RXER_Pos            (14UL)                    /*!< ETH0_CON ETH0_CON: RXER (Bit 14)                            */
#define ETH_CON_RXER_Msk            (0xc000UL)                /*!< ETH0_CON ETH0_CON: RXER (Bitfield-Mask: 0x03)               */
#define ETH_CON_COL_Pos             (16UL)                    /*!< ETH0_CON ETH0_CON: COL (Bit 16)                             */
#define ETH_CON_COL_Msk             (0x30000UL)               /*!< ETH0_CON ETH0_CON: COL (Bitfield-Mask: 0x03)                */
#define ETH_CON_CLK_TX_Pos          (18UL)                    /*!< ETH0_CON ETH0_CON: CLK_TX (Bit 18)                          */
#define ETH_CON_CLK_TX_Msk          (0xc0000UL)               /*!< ETH0_CON ETH0_CON: CLK_TX (Bitfield-Mask: 0x03)             */
#define ETH_CON_MDIO_Pos            (22UL)                    /*!< ETH0_CON ETH0_CON: MDIO (Bit 22)                            */
#define ETH_CON_MDIO_Msk            (0xc00000UL)              /*!< ETH0_CON ETH0_CON: MDIO (Bitfield-Mask: 0x03)               */
#define ETH_CON_INFSEL_Pos          (26UL)                    /*!< ETH0_CON ETH0_CON: INFSEL (Bit 26)                          */
#define ETH_CON_INFSEL_Msk          (0x4000000UL)             /*!< ETH0_CON ETH0_CON: INFSEL (Bitfield-Mask: 0x01)             */


/* ================================================================================ */
/* ================           Group 'ETH' Position & Mask          ================ */
/* ================================================================================ */


/* ----------------------------  ETH_MAC_CONFIGURATION  --------------------------- */
#define ETH_MAC_CONFIGURATION_PRELEN_Pos      (0UL)                     /*!< ETH MAC_CONFIGURATION: PRELEN (Bit 0)                       */
#define ETH_MAC_CONFIGURATION_PRELEN_Msk      (0x3UL)                   /*!< ETH MAC_CONFIGURATION: PRELEN (Bitfield-Mask: 0x03)         */
#define ETH_MAC_CONFIGURATION_RE_Pos          (2UL)                     /*!< ETH MAC_CONFIGURATION: RE (Bit 2)                           */
#define ETH_MAC_CONFIGURATION_RE_Msk          (0x4UL)                   /*!< ETH MAC_CONFIGURATION: RE (Bitfield-Mask: 0x01)             */
#define ETH_MAC_CONFIGURATION_TE_Pos          (3UL)                     /*!< ETH MAC_CONFIGURATION: TE (Bit 3)                           */
#define ETH_MAC_CONFIGURATION_TE_Msk          (0x8UL)                   /*!< ETH MAC_CONFIGURATION: TE (Bitfield-Mask: 0x01)             */
#define ETH_MAC_CONFIGURATION_DC_Pos          (4UL)                     /*!< ETH MAC_CONFIGURATION: DC (Bit 4)                           */
#define ETH_MAC_CONFIGURATION_DC_Msk          (0x10UL)                  /*!< ETH MAC_CONFIGURATION: DC (Bitfield-Mask: 0x01)             */
#define ETH_MAC_CONFIGURATION_BL_Pos          (5UL)                     /*!< ETH MAC_CONFIGURATION: BL (Bit 5)                           */
#define ETH_MAC_CONFIGURATION_BL_Msk          (0x60UL)                  /*!< ETH MAC_CONFIGURATION: BL (Bitfield-Mask: 0x03)             */
#define ETH_MAC_CONFIGURATION_ACS_Pos         (7UL)                     /*!< ETH MAC_CONFIGURATION: ACS (Bit 7)                          */
#define ETH_MAC_CONFIGURATION_ACS_Msk         (0x80UL)                  /*!< ETH MAC_CONFIGURATION: ACS (Bitfield-Mask: 0x01)            */
#define ETH_MAC_CONFIGURATION_DR_Pos          (9UL)                     /*!< ETH MAC_CONFIGURATION: DR (Bit 9)                           */
#define ETH_MAC_CONFIGURATION_DR_Msk          (0x200UL)                 /*!< ETH MAC_CONFIGURATION: DR (Bitfield-Mask: 0x01)             */
#define ETH_MAC_CONFIGURATION_IPC_Pos         (10UL)                    /*!< ETH MAC_CONFIGURATION: IPC (Bit 10)                         */
#define ETH_MAC_CONFIGURATION_IPC_Msk         (0x400UL)                 /*!< ETH MAC_CONFIGURATION: IPC (Bitfield-Mask: 0x01)            */
#define ETH_MAC_CONFIGURATION_DM_Pos          (11UL)                    /*!< ETH MAC_CONFIGURATION: DM (Bit 11)                          */
#define ETH_MAC_CONFIGURATION_DM_Msk          (0x800UL)                 /*!< ETH MAC_CONFIGURATION: DM (Bitfield-Mask: 0x01)             */
#define ETH_MAC_CONFIGURATION_LM_Pos          (12UL)                    /*!< ETH MAC_CONFIGURATION: LM (Bit 12)                          */
#define ETH_MAC_CONFIGURATION_LM_Msk          (0x1000UL)                /*!< ETH MAC_CONFIGURATION: LM (Bitfield-Mask: 0x01)             */
#define ETH_MAC_CONFIGURATION_DO_Pos          (13UL)                    /*!< ETH MAC_CONFIGURATION: DO (Bit 13)                          */
#define ETH_MAC_CONFIGURATION_DO_Msk          (0x2000UL)                /*!< ETH MAC_CONFIGURATION: DO (Bitfield-Mask: 0x01)             */
#define ETH_MAC_CONFIGURATION_FES_Pos         (14UL)                    /*!< ETH MAC_CONFIGURATION: FES (Bit 14)                         */
#define ETH_MAC_CONFIGURATION_FES_Msk         (0x4000UL)                /*!< ETH MAC_CONFIGURATION: FES (Bitfield-Mask: 0x01)            */
#define ETH_MAC_CONFIGURATION_DCRS_Pos        (16UL)                    /*!< ETH MAC_CONFIGURATION: DCRS (Bit 16)                        */
#define ETH_MAC_CONFIGURATION_DCRS_Msk        (0x10000UL)               /*!< ETH MAC_CONFIGURATION: DCRS (Bitfield-Mask: 0x01)           */
#define ETH_MAC_CONFIGURATION_IFG_Pos         (17UL)                    /*!< ETH MAC_CONFIGURATION: IFG (Bit 17)                         */
#define ETH_MAC_CONFIGURATION_IFG_Msk         (0xe0000UL)               /*!< ETH MAC_CONFIGURATION: IFG (Bitfield-Mask: 0x07)            */
#define ETH_MAC_CONFIGURATION_JE_Pos          (20UL)                    /*!< ETH MAC_CONFIGURATION: JE (Bit 20)                          */
#define ETH_MAC_CONFIGURATION_JE_Msk          (0x100000UL)              /*!< ETH MAC_CONFIGURATION: JE (Bitfield-Mask: 0x01)             */
#define ETH_MAC_CONFIGURATION_BE_Pos          (21UL)                    /*!< ETH MAC_CONFIGURATION: BE (Bit 21)                          */
#define ETH_MAC_CONFIGURATION_BE_Msk          (0x200000UL)              /*!< ETH MAC_CONFIGURATION: BE (Bitfield-Mask: 0x01)             */
#define ETH_MAC_CONFIGURATION_JD_Pos          (22UL)                    /*!< ETH MAC_CONFIGURATION: JD (Bit 22)                          */
#define ETH_MAC_CONFIGURATION_JD_Msk          (0x400000UL)              /*!< ETH MAC_CONFIGURATION: JD (Bitfield-Mask: 0x01)             */
#define ETH_MAC_CONFIGURATION_WD_Pos          (23UL)                    /*!< ETH MAC_CONFIGURATION: WD (Bit 23)                          */
#define ETH_MAC_CONFIGURATION_WD_Msk          (0x800000UL)              /*!< ETH MAC_CONFIGURATION: WD (Bitfield-Mask: 0x01)             */
#define ETH_MAC_CONFIGURATION_TC_Pos          (24UL)                    /*!< ETH MAC_CONFIGURATION: TC (Bit 24)                          */
#define ETH_MAC_CONFIGURATION_TC_Msk          (0x1000000UL)             /*!< ETH MAC_CONFIGURATION: TC (Bitfield-Mask: 0x01)             */
#define ETH_MAC_CONFIGURATION_CST_Pos         (25UL)                    /*!< ETH MAC_CONFIGURATION: CST (Bit 25)                         */
#define ETH_MAC_CONFIGURATION_CST_Msk         (0x2000000UL)             /*!< ETH MAC_CONFIGURATION: CST (Bitfield-Mask: 0x01)            */
#define ETH_MAC_CONFIGURATION_TWOKPE_Pos      (27UL)                    /*!< ETH MAC_CONFIGURATION: TWOKPE (Bit 27)                      */
#define ETH_MAC_CONFIGURATION_TWOKPE_Msk      (0x8000000UL)             /*!< ETH MAC_CONFIGURATION: TWOKPE (Bitfield-Mask: 0x01)         */
#define ETH_MAC_CONFIGURATION_SARC_Pos        (28UL)                    /*!< ETH MAC_CONFIGURATION: SARC (Bit 28)                        */
#define ETH_MAC_CONFIGURATION_SARC_Msk        (0x70000000UL)            /*!< ETH MAC_CONFIGURATION: SARC (Bitfield-Mask: 0x07)           */

