alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4700_series/Include/XMC4700.h
/* -----------------------------  USB_EP_DOEPTSIZ0  ----------------------------- */
#define USB_EP_DOEPTSIZ0_XferSize_Pos       (0UL)                     /*!< USB0_EP0 DOEPTSIZ0: XferSize (Bit 0)                        */
#define USB_EP_DOEPTSIZ0_XferSize_Msk       (0x7fUL)                  /*!< USB0_EP0 DOEPTSIZ0: XferSize (Bitfield-Mask: 0x7f)          */
#define USB_EP_DOEPTSIZ0_PktCnt_Pos         (19UL)                    /*!< USB0_EP0 DOEPTSIZ0: PktCnt (Bit 19)                         */
#define USB_EP_DOEPTSIZ0_PktCnt_Msk         (0x180000UL)              /*!< USB0_EP0 DOEPTSIZ0: PktCnt (Bitfield-Mask: 0x03)            */
#define USB_EP_DOEPTSIZ0_SUPCnt_Pos         (29UL)                    /*!< USB0_EP0 DOEPTSIZ0: SUPCnt (Bit 29)                         */
#define USB_EP_DOEPTSIZ0_SUPCnt_Msk         (0x60000000UL)            /*!< USB0_EP0 DOEPTSIZ0: SUPCnt (Bitfield-Mask: 0x03)            */

/* ------------------------------  USB_EP_DOEPDMA0  ----------------------------- */
#define USB_EP_DOEPDMA0_DMAAddr_Pos         (0UL)                     /*!< USB0_EP0 DOEPDMA0: DMAAddr (Bit 0)                          */
#define USB_EP_DOEPDMA0_DMAAddr_Msk         (0xffffffffUL)            /*!< USB0_EP0 DOEPDMA0: DMAAddr (Bitfield-Mask: 0xffffffff)      */

/* -----------------------------  USB_EP_DOEPDMAB0  ----------------------------- */
#define USB_EP_DOEPDMAB0_DMABufferAddr_Pos  (0UL)                     /*!< USB0_EP0 DOEPDMAB0: DMABufferAddr (Bit 0)                   */
#define USB_EP_DOEPDMAB0_DMABufferAddr_Msk  (0xffffffffUL)            /*!< USB0_EP0 DOEPDMAB0: DMABufferAddr (Bitfield-Mask: 0xffffffff) */


/* ================================================================================ */
/* ================         Group 'USB_EP' Position & Mask         ================ */
/* ================================================================================ */


/* ---------------------------  USB_EP_DIEPCTL_ISOCONT  --------------------------- */
#define USB_EP_DIEPCTL_ISOCONT_MPS_Pos        (0UL)                     /*!< USB_EP DIEPCTL_ISOCONT: MPS (Bit 0)                         */
#define USB_EP_DIEPCTL_ISOCONT_MPS_Msk        (0x7ffUL)                 /*!< USB_EP DIEPCTL_ISOCONT: MPS (Bitfield-Mask: 0x7ff)          */
#define USB_EP_DIEPCTL_ISOCONT_USBActEP_Pos   (15UL)                    /*!< USB_EP DIEPCTL_ISOCONT: USBActEP (Bit 15)                   */
#define USB_EP_DIEPCTL_ISOCONT_USBActEP_Msk   (0x8000UL)                /*!< USB_EP DIEPCTL_ISOCONT: USBActEP (Bitfield-Mask: 0x01)      */
#define USB_EP_DIEPCTL_ISOCONT_EO_FrNum_Pos   (16UL)                    /*!< USB_EP DIEPCTL_ISOCONT: EO_FrNum (Bit 16)                   */
#define USB_EP_DIEPCTL_ISOCONT_EO_FrNum_Msk   (0x10000UL)               /*!< USB_EP DIEPCTL_ISOCONT: EO_FrNum (Bitfield-Mask: 0x01)      */
#define USB_EP_DIEPCTL_ISOCONT_NAKSts_Pos     (17UL)                    /*!< USB_EP DIEPCTL_ISOCONT: NAKSts (Bit 17)                     */
#define USB_EP_DIEPCTL_ISOCONT_NAKSts_Msk     (0x20000UL)               /*!< USB_EP DIEPCTL_ISOCONT: NAKSts (Bitfield-Mask: 0x01)        */
#define USB_EP_DIEPCTL_ISOCONT_EPType_Pos     (18UL)                    /*!< USB_EP DIEPCTL_ISOCONT: EPType (Bit 18)                     */
#define USB_EP_DIEPCTL_ISOCONT_EPType_Msk     (0xc0000UL)               /*!< USB_EP DIEPCTL_ISOCONT: EPType (Bitfield-Mask: 0x03)        */
#define USB_EP_DIEPCTL_ISOCONT_Snp_Pos        (20UL)                    /*!< USB_EP DIEPCTL_ISOCONT: Snp (Bit 20)                        */
#define USB_EP_DIEPCTL_ISOCONT_Snp_Msk        (0x100000UL)              /*!< USB_EP DIEPCTL_ISOCONT: Snp (Bitfield-Mask: 0x01)           */
#define USB_EP_DIEPCTL_ISOCONT_Stall_Pos      (21UL)                    /*!< USB_EP DIEPCTL_ISOCONT: Stall (Bit 21)                      */
#define USB_EP_DIEPCTL_ISOCONT_Stall_Msk      (0x200000UL)              /*!< USB_EP DIEPCTL_ISOCONT: Stall (Bitfield-Mask: 0x01)         */
#define USB_EP_DIEPCTL_ISOCONT_TxFNum_Pos     (22UL)                    /*!< USB_EP DIEPCTL_ISOCONT: TxFNum (Bit 22)                     */
#define USB_EP_DIEPCTL_ISOCONT_TxFNum_Msk     (0x3c00000UL)             /*!< USB_EP DIEPCTL_ISOCONT: TxFNum (Bitfield-Mask: 0x0f)        */
#define USB_EP_DIEPCTL_ISOCONT_CNAK_Pos       (26UL)                    /*!< USB_EP DIEPCTL_ISOCONT: CNAK (Bit 26)                       */
#define USB_EP_DIEPCTL_ISOCONT_CNAK_Msk       (0x4000000UL)             /*!< USB_EP DIEPCTL_ISOCONT: CNAK (Bitfield-Mask: 0x01)          */
#define USB_EP_DIEPCTL_ISOCONT_SNAK_Pos       (27UL)                    /*!< USB_EP DIEPCTL_ISOCONT: SNAK (Bit 27)                       */
#define USB_EP_DIEPCTL_ISOCONT_SNAK_Msk       (0x8000000UL)             /*!< USB_EP DIEPCTL_ISOCONT: SNAK (Bitfield-Mask: 0x01)          */
#define USB_EP_DIEPCTL_ISOCONT_SetEvenFr_Pos  (28UL)                    /*!< USB_EP DIEPCTL_ISOCONT: SetEvenFr (Bit 28)                  */
#define USB_EP_DIEPCTL_ISOCONT_SetEvenFr_Msk  (0x10000000UL)            /*!< USB_EP DIEPCTL_ISOCONT: SetEvenFr (Bitfield-Mask: 0x01)     */
#define USB_EP_DIEPCTL_ISOCONT_SetOddFr_Pos   (29UL)                    /*!< USB_EP DIEPCTL_ISOCONT: SetOddFr (Bit 29)                   */
#define USB_EP_DIEPCTL_ISOCONT_SetOddFr_Msk   (0x20000000UL)            /*!< USB_EP DIEPCTL_ISOCONT: SetOddFr (Bitfield-Mask: 0x01)      */
#define USB_EP_DIEPCTL_ISOCONT_EPDis_Pos      (30UL)                    /*!< USB_EP DIEPCTL_ISOCONT: EPDis (Bit 30)                      */
#define USB_EP_DIEPCTL_ISOCONT_EPDis_Msk      (0x40000000UL)            /*!< USB_EP DIEPCTL_ISOCONT: EPDis (Bitfield-Mask: 0x01)         */
#define USB_EP_DIEPCTL_ISOCONT_EPEna_Pos      (31UL)                    /*!< USB_EP DIEPCTL_ISOCONT: EPEna (Bit 31)                      */
#define USB_EP_DIEPCTL_ISOCONT_EPEna_Msk      (0x80000000UL)            /*!< USB_EP DIEPCTL_ISOCONT: EPEna (Bitfield-Mask: 0x01)         */

/* ---------------------------  USB_EP_DIEPCTL_INTBULK  --------------------------- */
#define USB_EP_DIEPCTL_INTBULK_MPS_Pos        (0UL)                     /*!< USB_EP DIEPCTL_INTBULK: MPS (Bit 0)                         */
#define USB_EP_DIEPCTL_INTBULK_MPS_Msk        (0x7ffUL)                 /*!< USB_EP DIEPCTL_INTBULK: MPS (Bitfield-Mask: 0x7ff)          */
#define USB_EP_DIEPCTL_INTBULK_USBActEP_Pos   (15UL)                    /*!< USB_EP DIEPCTL_INTBULK: USBActEP (Bit 15)                   */
#define USB_EP_DIEPCTL_INTBULK_USBActEP_Msk   (0x8000UL)                /*!< USB_EP DIEPCTL_INTBULK: USBActEP (Bitfield-Mask: 0x01)      */
#define USB_EP_DIEPCTL_INTBULK_DPID_Pos       (16UL)                    /*!< USB_EP DIEPCTL_INTBULK: DPID (Bit 16)                       */
#define USB_EP_DIEPCTL_INTBULK_DPID_Msk       (0x10000UL)               /*!< USB_EP DIEPCTL_INTBULK: DPID (Bitfield-Mask: 0x01)          */
#define USB_EP_DIEPCTL_INTBULK_NAKSts_Pos     (17UL)                    /*!< USB_EP DIEPCTL_INTBULK: NAKSts (Bit 17)                     */
#define USB_EP_DIEPCTL_INTBULK_NAKSts_Msk     (0x20000UL)               /*!< USB_EP DIEPCTL_INTBULK: NAKSts (Bitfield-Mask: 0x01)        */
#define USB_EP_DIEPCTL_INTBULK_EPType_Pos     (18UL)                    /*!< USB_EP DIEPCTL_INTBULK: EPType (Bit 18)                     */
#define USB_EP_DIEPCTL_INTBULK_EPType_Msk     (0xc0000UL)               /*!< USB_EP DIEPCTL_INTBULK: EPType (Bitfield-Mask: 0x03)        */
#define USB_EP_DIEPCTL_INTBULK_Snp_Pos        (20UL)                    /*!< USB_EP DIEPCTL_INTBULK: Snp (Bit 20)                        */
#define USB_EP_DIEPCTL_INTBULK_Snp_Msk        (0x100000UL)              /*!< USB_EP DIEPCTL_INTBULK: Snp (Bitfield-Mask: 0x01)           */
#define USB_EP_DIEPCTL_INTBULK_Stall_Pos      (21UL)                    /*!< USB_EP DIEPCTL_INTBULK: Stall (Bit 21)                      */
#define USB_EP_DIEPCTL_INTBULK_Stall_Msk      (0x200000UL)              /*!< USB_EP DIEPCTL_INTBULK: Stall (Bitfield-Mask: 0x01)         */
#define USB_EP_DIEPCTL_INTBULK_TxFNum_Pos     (22UL)                    /*!< USB_EP DIEPCTL_INTBULK: TxFNum (Bit 22)                     */
#define USB_EP_DIEPCTL_INTBULK_TxFNum_Msk     (0x3c00000UL)             /*!< USB_EP DIEPCTL_INTBULK: TxFNum (Bitfield-Mask: 0x0f)        */
#define USB_EP_DIEPCTL_INTBULK_CNAK_Pos       (26UL)                    /*!< USB_EP DIEPCTL_INTBULK: CNAK (Bit 26)                       */
#define USB_EP_DIEPCTL_INTBULK_CNAK_Msk       (0x4000000UL)             /*!< USB_EP DIEPCTL_INTBULK: CNAK (Bitfield-Mask: 0x01)          */
#define USB_EP_DIEPCTL_INTBULK_SNAK_Pos       (27UL)                    /*!< USB_EP DIEPCTL_INTBULK: SNAK (Bit 27)                       */
#define USB_EP_DIEPCTL_INTBULK_SNAK_Msk       (0x8000000UL)             /*!< USB_EP DIEPCTL_INTBULK: SNAK (Bitfield-Mask: 0x01)          */
#define USB_EP_DIEPCTL_INTBULK_SetD0PID_Pos   (28UL)                    /*!< USB_EP DIEPCTL_INTBULK: SetD0PID (Bit 28)                   */
#define USB_EP_DIEPCTL_INTBULK_SetD0PID_Msk   (0x10000000UL)            /*!< USB_EP DIEPCTL_INTBULK: SetD0PID (Bitfield-Mask: 0x01)      */
#define USB_EP_DIEPCTL_INTBULK_SetD1PID_Pos   (29UL)                    /*!< USB_EP DIEPCTL_INTBULK: SetD1PID (Bit 29)                   */
#define USB_EP_DIEPCTL_INTBULK_SetD1PID_Msk   (0x20000000UL)            /*!< USB_EP DIEPCTL_INTBULK: SetD1PID (Bitfield-Mask: 0x01)      */
#define USB_EP_DIEPCTL_INTBULK_EPDis_Pos      (30UL)                    /*!< USB_EP DIEPCTL_INTBULK: EPDis (Bit 30)                      */
#define USB_EP_DIEPCTL_INTBULK_EPDis_Msk      (0x40000000UL)            /*!< USB_EP DIEPCTL_INTBULK: EPDis (Bitfield-Mask: 0x01)         */
#define USB_EP_DIEPCTL_INTBULK_EPEna_Pos      (31UL)                    /*!< USB_EP DIEPCTL_INTBULK: EPEna (Bit 31)                      */
#define USB_EP_DIEPCTL_INTBULK_EPEna_Msk      (0x80000000UL)            /*!< USB_EP DIEPCTL_INTBULK: EPEna (Bitfield-Mask: 0x01)         */

/* -------------------------------  USB_EP_DIEPINT  ------------------------------- */
#define USB_EP_DIEPINT_XferCompl_Pos          (0UL)                     /*!< USB_EP DIEPINT: XferCompl (Bit 0)                           */
#define USB_EP_DIEPINT_XferCompl_Msk          (0x1UL)                   /*!< USB_EP DIEPINT: XferCompl (Bitfield-Mask: 0x01)             */
#define USB_EP_DIEPINT_EPDisbld_Pos           (1UL)                     /*!< USB_EP DIEPINT: EPDisbld (Bit 1)                            */
#define USB_EP_DIEPINT_EPDisbld_Msk           (0x2UL)                   /*!< USB_EP DIEPINT: EPDisbld (Bitfield-Mask: 0x01)              */
#define USB_EP_DIEPINT_AHBErr_Pos             (2UL)                     /*!< USB_EP DIEPINT: AHBErr (Bit 2)                              */
#define USB_EP_DIEPINT_AHBErr_Msk             (0x4UL)                   /*!< USB_EP DIEPINT: AHBErr (Bitfield-Mask: 0x01)                */
#define USB_EP_DIEPINT_TimeOUT_Pos            (3UL)                     /*!< USB_EP DIEPINT: TimeOUT (Bit 3)                             */
#define USB_EP_DIEPINT_TimeOUT_Msk            (0x8UL)                   /*!< USB_EP DIEPINT: TimeOUT (Bitfield-Mask: 0x01)               */
#define USB_EP_DIEPINT_INTknTXFEmp_Pos        (4UL)                     /*!< USB_EP DIEPINT: INTknTXFEmp (Bit 4)                         */
#define USB_EP_DIEPINT_INTknTXFEmp_Msk        (0x10UL)                  /*!< USB_EP DIEPINT: INTknTXFEmp (Bitfield-Mask: 0x01)           */
#define USB_EP_DIEPINT_INEPNakEff_Pos         (6UL)                     /*!< USB_EP DIEPINT: INEPNakEff (Bit 6)                          */
#define USB_EP_DIEPINT_INEPNakEff_Msk         (0x40UL)                  /*!< USB_EP DIEPINT: INEPNakEff (Bitfield-Mask: 0x01)            */
#define USB_EP_DIEPINT_TxFEmp_Pos             (7UL)                     /*!< USB_EP DIEPINT: TxFEmp (Bit 7)                              */
#define USB_EP_DIEPINT_TxFEmp_Msk             (0x80UL)                  /*!< USB_EP DIEPINT: TxFEmp (Bitfield-Mask: 0x01)                */
#define USB_EP_DIEPINT_BNAIntr_Pos            (9UL)                     /*!< USB_EP DIEPINT: BNAIntr (Bit 9)                             */
#define USB_EP_DIEPINT_BNAIntr_Msk            (0x200UL)                 /*!< USB_EP DIEPINT: BNAIntr (Bitfield-Mask: 0x01)               */

/* -------------------------------  USB_EP_DIEPTSIZ  ------------------------------ */
#define USB_EP_DIEPTSIZ_XferSize_Pos          (0UL)                     /*!< USB_EP DIEPTSIZ: XferSize (Bit 0)                           */
#define USB_EP_DIEPTSIZ_XferSize_Msk          (0x7ffffUL)               /*!< USB_EP DIEPTSIZ: XferSize (Bitfield-Mask: 0x7ffff)          */
#define USB_EP_DIEPTSIZ_PktCnt_Pos            (19UL)                    /*!< USB_EP DIEPTSIZ: PktCnt (Bit 19)                            */
#define USB_EP_DIEPTSIZ_PktCnt_Msk            (0x1ff80000UL)            /*!< USB_EP DIEPTSIZ: PktCnt (Bitfield-Mask: 0x3ff)              */

/* -------------------------------  USB_EP_DIEPDMA  ------------------------------- */
#define USB_EP_DIEPDMA_DMAAddr_Pos            (0UL)                     /*!< USB_EP DIEPDMA: DMAAddr (Bit 0)                             */
#define USB_EP_DIEPDMA_DMAAddr_Msk            (0xffffffffUL)            /*!< USB_EP DIEPDMA: DMAAddr (Bitfield-Mask: 0xffffffff)         */

