alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4700_series/Include/XMC4700.h
/* ---------------------------------  PORT9_HWSEL  -------------------------------- */
#define PORT9_HWSEL_HW0_Pos                   (0UL)                     /*!< PORT9 HWSEL: HW0 (Bit 0)                                    */
#define PORT9_HWSEL_HW0_Msk                   (0x3UL)                   /*!< PORT9 HWSEL: HW0 (Bitfield-Mask: 0x03)                      */
#define PORT9_HWSEL_HW1_Pos                   (2UL)                     /*!< PORT9 HWSEL: HW1 (Bit 2)                                    */
#define PORT9_HWSEL_HW1_Msk                   (0xcUL)                   /*!< PORT9 HWSEL: HW1 (Bitfield-Mask: 0x03)                      */
#define PORT9_HWSEL_HW2_Pos                   (4UL)                     /*!< PORT9 HWSEL: HW2 (Bit 4)                                    */
#define PORT9_HWSEL_HW2_Msk                   (0x30UL)                  /*!< PORT9 HWSEL: HW2 (Bitfield-Mask: 0x03)                      */
#define PORT9_HWSEL_HW3_Pos                   (6UL)                     /*!< PORT9 HWSEL: HW3 (Bit 6)                                    */
#define PORT9_HWSEL_HW3_Msk                   (0xc0UL)                  /*!< PORT9 HWSEL: HW3 (Bitfield-Mask: 0x03)                      */
#define PORT9_HWSEL_HW4_Pos                   (8UL)                     /*!< PORT9 HWSEL: HW4 (Bit 8)                                    */
#define PORT9_HWSEL_HW4_Msk                   (0x300UL)                 /*!< PORT9 HWSEL: HW4 (Bitfield-Mask: 0x03)                      */
#define PORT9_HWSEL_HW5_Pos                   (10UL)                    /*!< PORT9 HWSEL: HW5 (Bit 10)                                   */
#define PORT9_HWSEL_HW5_Msk                   (0xc00UL)                 /*!< PORT9 HWSEL: HW5 (Bitfield-Mask: 0x03)                      */
#define PORT9_HWSEL_HW6_Pos                   (12UL)                    /*!< PORT9 HWSEL: HW6 (Bit 12)                                   */
#define PORT9_HWSEL_HW6_Msk                   (0x3000UL)                /*!< PORT9 HWSEL: HW6 (Bitfield-Mask: 0x03)                      */
#define PORT9_HWSEL_HW7_Pos                   (14UL)                    /*!< PORT9 HWSEL: HW7 (Bit 14)                                   */
#define PORT9_HWSEL_HW7_Msk                   (0xc000UL)                /*!< PORT9 HWSEL: HW7 (Bitfield-Mask: 0x03)                      */
#define PORT9_HWSEL_HW8_Pos                   (16UL)                    /*!< PORT9 HWSEL: HW8 (Bit 16)                                   */
#define PORT9_HWSEL_HW8_Msk                   (0x30000UL)               /*!< PORT9 HWSEL: HW8 (Bitfield-Mask: 0x03)                      */
#define PORT9_HWSEL_HW9_Pos                   (18UL)                    /*!< PORT9 HWSEL: HW9 (Bit 18)                                   */
#define PORT9_HWSEL_HW9_Msk                   (0xc0000UL)               /*!< PORT9 HWSEL: HW9 (Bitfield-Mask: 0x03)                      */
#define PORT9_HWSEL_HW10_Pos                  (20UL)                    /*!< PORT9 HWSEL: HW10 (Bit 20)                                  */
#define PORT9_HWSEL_HW10_Msk                  (0x300000UL)              /*!< PORT9 HWSEL: HW10 (Bitfield-Mask: 0x03)                     */
#define PORT9_HWSEL_HW11_Pos                  (22UL)                    /*!< PORT9 HWSEL: HW11 (Bit 22)                                  */
#define PORT9_HWSEL_HW11_Msk                  (0xc00000UL)              /*!< PORT9 HWSEL: HW11 (Bitfield-Mask: 0x03)                     */
#define PORT9_HWSEL_HW12_Pos                  (24UL)                    /*!< PORT9 HWSEL: HW12 (Bit 24)                                  */
#define PORT9_HWSEL_HW12_Msk                  (0x3000000UL)             /*!< PORT9 HWSEL: HW12 (Bitfield-Mask: 0x03)                     */
#define PORT9_HWSEL_HW13_Pos                  (26UL)                    /*!< PORT9 HWSEL: HW13 (Bit 26)                                  */
#define PORT9_HWSEL_HW13_Msk                  (0xc000000UL)             /*!< PORT9 HWSEL: HW13 (Bitfield-Mask: 0x03)                     */
#define PORT9_HWSEL_HW14_Pos                  (28UL)                    /*!< PORT9 HWSEL: HW14 (Bit 28)                                  */
#define PORT9_HWSEL_HW14_Msk                  (0x30000000UL)            /*!< PORT9 HWSEL: HW14 (Bitfield-Mask: 0x03)                     */
#define PORT9_HWSEL_HW15_Pos                  (30UL)                    /*!< PORT9 HWSEL: HW15 (Bit 30)                                  */
#define PORT9_HWSEL_HW15_Msk                  (0xc0000000UL)            /*!< PORT9 HWSEL: HW15 (Bitfield-Mask: 0x03)                     */


/* ================================================================================ */
/* ================         struct 'PORT14' Position & Mask        ================ */
/* ================================================================================ */


/* ---------------------------------  PORT14_OUT  --------------------------------- */
#define PORT14_OUT_P0_Pos                     (0UL)                     /*!< PORT14 OUT: P0 (Bit 0)                                      */
#define PORT14_OUT_P0_Msk                     (0x1UL)                   /*!< PORT14 OUT: P0 (Bitfield-Mask: 0x01)                        */
#define PORT14_OUT_P1_Pos                     (1UL)                     /*!< PORT14 OUT: P1 (Bit 1)                                      */
#define PORT14_OUT_P1_Msk                     (0x2UL)                   /*!< PORT14 OUT: P1 (Bitfield-Mask: 0x01)                        */
#define PORT14_OUT_P2_Pos                     (2UL)                     /*!< PORT14 OUT: P2 (Bit 2)                                      */
#define PORT14_OUT_P2_Msk                     (0x4UL)                   /*!< PORT14 OUT: P2 (Bitfield-Mask: 0x01)                        */
#define PORT14_OUT_P3_Pos                     (3UL)                     /*!< PORT14 OUT: P3 (Bit 3)                                      */
#define PORT14_OUT_P3_Msk                     (0x8UL)                   /*!< PORT14 OUT: P3 (Bitfield-Mask: 0x01)                        */
#define PORT14_OUT_P4_Pos                     (4UL)                     /*!< PORT14 OUT: P4 (Bit 4)                                      */
#define PORT14_OUT_P4_Msk                     (0x10UL)                  /*!< PORT14 OUT: P4 (Bitfield-Mask: 0x01)                        */
#define PORT14_OUT_P5_Pos                     (5UL)                     /*!< PORT14 OUT: P5 (Bit 5)                                      */
#define PORT14_OUT_P5_Msk                     (0x20UL)                  /*!< PORT14 OUT: P5 (Bitfield-Mask: 0x01)                        */
#define PORT14_OUT_P6_Pos                     (6UL)                     /*!< PORT14 OUT: P6 (Bit 6)                                      */
#define PORT14_OUT_P6_Msk                     (0x40UL)                  /*!< PORT14 OUT: P6 (Bitfield-Mask: 0x01)                        */
#define PORT14_OUT_P7_Pos                     (7UL)                     /*!< PORT14 OUT: P7 (Bit 7)                                      */
#define PORT14_OUT_P7_Msk                     (0x80UL)                  /*!< PORT14 OUT: P7 (Bitfield-Mask: 0x01)                        */
#define PORT14_OUT_P8_Pos                     (8UL)                     /*!< PORT14 OUT: P8 (Bit 8)                                      */
#define PORT14_OUT_P8_Msk                     (0x100UL)                 /*!< PORT14 OUT: P8 (Bitfield-Mask: 0x01)                        */
#define PORT14_OUT_P9_Pos                     (9UL)                     /*!< PORT14 OUT: P9 (Bit 9)                                      */
#define PORT14_OUT_P9_Msk                     (0x200UL)                 /*!< PORT14 OUT: P9 (Bitfield-Mask: 0x01)                        */
#define PORT14_OUT_P10_Pos                    (10UL)                    /*!< PORT14 OUT: P10 (Bit 10)                                    */
#define PORT14_OUT_P10_Msk                    (0x400UL)                 /*!< PORT14 OUT: P10 (Bitfield-Mask: 0x01)                       */
#define PORT14_OUT_P11_Pos                    (11UL)                    /*!< PORT14 OUT: P11 (Bit 11)                                    */
#define PORT14_OUT_P11_Msk                    (0x800UL)                 /*!< PORT14 OUT: P11 (Bitfield-Mask: 0x01)                       */
#define PORT14_OUT_P12_Pos                    (12UL)                    /*!< PORT14 OUT: P12 (Bit 12)                                    */
#define PORT14_OUT_P12_Msk                    (0x1000UL)                /*!< PORT14 OUT: P12 (Bitfield-Mask: 0x01)                       */
#define PORT14_OUT_P13_Pos                    (13UL)                    /*!< PORT14 OUT: P13 (Bit 13)                                    */
#define PORT14_OUT_P13_Msk                    (0x2000UL)                /*!< PORT14 OUT: P13 (Bitfield-Mask: 0x01)                       */
#define PORT14_OUT_P14_Pos                    (14UL)                    /*!< PORT14 OUT: P14 (Bit 14)                                    */
#define PORT14_OUT_P14_Msk                    (0x4000UL)                /*!< PORT14 OUT: P14 (Bitfield-Mask: 0x01)                       */
#define PORT14_OUT_P15_Pos                    (15UL)                    /*!< PORT14 OUT: P15 (Bit 15)                                    */
#define PORT14_OUT_P15_Msk                    (0x8000UL)                /*!< PORT14 OUT: P15 (Bitfield-Mask: 0x01)                       */

/* ---------------------------------  PORT14_OMR  --------------------------------- */
#define PORT14_OMR_PS0_Pos                    (0UL)                     /*!< PORT14 OMR: PS0 (Bit 0)                                     */
#define PORT14_OMR_PS0_Msk                    (0x1UL)                   /*!< PORT14 OMR: PS0 (Bitfield-Mask: 0x01)                       */
#define PORT14_OMR_PS1_Pos                    (1UL)                     /*!< PORT14 OMR: PS1 (Bit 1)                                     */
#define PORT14_OMR_PS1_Msk                    (0x2UL)                   /*!< PORT14 OMR: PS1 (Bitfield-Mask: 0x01)                       */
#define PORT14_OMR_PS2_Pos                    (2UL)                     /*!< PORT14 OMR: PS2 (Bit 2)                                     */
#define PORT14_OMR_PS2_Msk                    (0x4UL)                   /*!< PORT14 OMR: PS2 (Bitfield-Mask: 0x01)                       */
#define PORT14_OMR_PS3_Pos                    (3UL)                     /*!< PORT14 OMR: PS3 (Bit 3)                                     */
#define PORT14_OMR_PS3_Msk                    (0x8UL)                   /*!< PORT14 OMR: PS3 (Bitfield-Mask: 0x01)                       */
#define PORT14_OMR_PS4_Pos                    (4UL)                     /*!< PORT14 OMR: PS4 (Bit 4)                                     */
#define PORT14_OMR_PS4_Msk                    (0x10UL)                  /*!< PORT14 OMR: PS4 (Bitfield-Mask: 0x01)                       */
#define PORT14_OMR_PS5_Pos                    (5UL)                     /*!< PORT14 OMR: PS5 (Bit 5)                                     */
#define PORT14_OMR_PS5_Msk                    (0x20UL)                  /*!< PORT14 OMR: PS5 (Bitfield-Mask: 0x01)                       */
#define PORT14_OMR_PS6_Pos                    (6UL)                     /*!< PORT14 OMR: PS6 (Bit 6)                                     */
#define PORT14_OMR_PS6_Msk                    (0x40UL)                  /*!< PORT14 OMR: PS6 (Bitfield-Mask: 0x01)                       */
#define PORT14_OMR_PS7_Pos                    (7UL)                     /*!< PORT14 OMR: PS7 (Bit 7)                                     */
#define PORT14_OMR_PS7_Msk                    (0x80UL)                  /*!< PORT14 OMR: PS7 (Bitfield-Mask: 0x01)                       */
#define PORT14_OMR_PS8_Pos                    (8UL)                     /*!< PORT14 OMR: PS8 (Bit 8)                                     */
#define PORT14_OMR_PS8_Msk                    (0x100UL)                 /*!< PORT14 OMR: PS8 (Bitfield-Mask: 0x01)                       */
#define PORT14_OMR_PS9_Pos                    (9UL)                     /*!< PORT14 OMR: PS9 (Bit 9)                                     */
#define PORT14_OMR_PS9_Msk                    (0x200UL)                 /*!< PORT14 OMR: PS9 (Bitfield-Mask: 0x01)                       */
#define PORT14_OMR_PS10_Pos                   (10UL)                    /*!< PORT14 OMR: PS10 (Bit 10)                                   */
#define PORT14_OMR_PS10_Msk                   (0x400UL)                 /*!< PORT14 OMR: PS10 (Bitfield-Mask: 0x01)                      */
#define PORT14_OMR_PS11_Pos                   (11UL)                    /*!< PORT14 OMR: PS11 (Bit 11)                                   */
#define PORT14_OMR_PS11_Msk                   (0x800UL)                 /*!< PORT14 OMR: PS11 (Bitfield-Mask: 0x01)                      */
#define PORT14_OMR_PS12_Pos                   (12UL)                    /*!< PORT14 OMR: PS12 (Bit 12)                                   */
#define PORT14_OMR_PS12_Msk                   (0x1000UL)                /*!< PORT14 OMR: PS12 (Bitfield-Mask: 0x01)                      */
#define PORT14_OMR_PS13_Pos                   (13UL)                    /*!< PORT14 OMR: PS13 (Bit 13)                                   */
#define PORT14_OMR_PS13_Msk                   (0x2000UL)                /*!< PORT14 OMR: PS13 (Bitfield-Mask: 0x01)                      */
#define PORT14_OMR_PS14_Pos                   (14UL)                    /*!< PORT14 OMR: PS14 (Bit 14)                                   */
#define PORT14_OMR_PS14_Msk                   (0x4000UL)                /*!< PORT14 OMR: PS14 (Bitfield-Mask: 0x01)                      */
#define PORT14_OMR_PS15_Pos                   (15UL)                    /*!< PORT14 OMR: PS15 (Bit 15)                                   */
#define PORT14_OMR_PS15_Msk                   (0x8000UL)                /*!< PORT14 OMR: PS15 (Bitfield-Mask: 0x01)                      */
#define PORT14_OMR_PR0_Pos                    (16UL)                    /*!< PORT14 OMR: PR0 (Bit 16)                                    */
#define PORT14_OMR_PR0_Msk                    (0x10000UL)               /*!< PORT14 OMR: PR0 (Bitfield-Mask: 0x01)                       */
#define PORT14_OMR_PR1_Pos                    (17UL)                    /*!< PORT14 OMR: PR1 (Bit 17)                                    */
#define PORT14_OMR_PR1_Msk                    (0x20000UL)               /*!< PORT14 OMR: PR1 (Bitfield-Mask: 0x01)                       */
#define PORT14_OMR_PR2_Pos                    (18UL)                    /*!< PORT14 OMR: PR2 (Bit 18)                                    */
#define PORT14_OMR_PR2_Msk                    (0x40000UL)               /*!< PORT14 OMR: PR2 (Bitfield-Mask: 0x01)                       */
#define PORT14_OMR_PR3_Pos                    (19UL)                    /*!< PORT14 OMR: PR3 (Bit 19)                                    */
#define PORT14_OMR_PR3_Msk                    (0x80000UL)               /*!< PORT14 OMR: PR3 (Bitfield-Mask: 0x01)                       */
#define PORT14_OMR_PR4_Pos                    (20UL)                    /*!< PORT14 OMR: PR4 (Bit 20)                                    */
#define PORT14_OMR_PR4_Msk                    (0x100000UL)              /*!< PORT14 OMR: PR4 (Bitfield-Mask: 0x01)                       */
#define PORT14_OMR_PR5_Pos                    (21UL)                    /*!< PORT14 OMR: PR5 (Bit 21)                                    */
#define PORT14_OMR_PR5_Msk                    (0x200000UL)              /*!< PORT14 OMR: PR5 (Bitfield-Mask: 0x01)                       */
#define PORT14_OMR_PR6_Pos                    (22UL)                    /*!< PORT14 OMR: PR6 (Bit 22)                                    */
#define PORT14_OMR_PR6_Msk                    (0x400000UL)              /*!< PORT14 OMR: PR6 (Bitfield-Mask: 0x01)                       */
#define PORT14_OMR_PR7_Pos                    (23UL)                    /*!< PORT14 OMR: PR7 (Bit 23)                                    */
#define PORT14_OMR_PR7_Msk                    (0x800000UL)              /*!< PORT14 OMR: PR7 (Bitfield-Mask: 0x01)                       */
#define PORT14_OMR_PR8_Pos                    (24UL)                    /*!< PORT14 OMR: PR8 (Bit 24)                                    */
#define PORT14_OMR_PR8_Msk                    (0x1000000UL)             /*!< PORT14 OMR: PR8 (Bitfield-Mask: 0x01)                       */
#define PORT14_OMR_PR9_Pos                    (25UL)                    /*!< PORT14 OMR: PR9 (Bit 25)                                    */
#define PORT14_OMR_PR9_Msk                    (0x2000000UL)             /*!< PORT14 OMR: PR9 (Bitfield-Mask: 0x01)                       */
#define PORT14_OMR_PR10_Pos                   (26UL)                    /*!< PORT14 OMR: PR10 (Bit 26)                                   */
#define PORT14_OMR_PR10_Msk                   (0x4000000UL)             /*!< PORT14 OMR: PR10 (Bitfield-Mask: 0x01)                      */
#define PORT14_OMR_PR11_Pos                   (27UL)                    /*!< PORT14 OMR: PR11 (Bit 27)                                   */
#define PORT14_OMR_PR11_Msk                   (0x8000000UL)             /*!< PORT14 OMR: PR11 (Bitfield-Mask: 0x01)                      */
#define PORT14_OMR_PR12_Pos                   (28UL)                    /*!< PORT14 OMR: PR12 (Bit 28)                                   */
#define PORT14_OMR_PR12_Msk                   (0x10000000UL)            /*!< PORT14 OMR: PR12 (Bitfield-Mask: 0x01)                      */
#define PORT14_OMR_PR13_Pos                   (29UL)                    /*!< PORT14 OMR: PR13 (Bit 29)                                   */
#define PORT14_OMR_PR13_Msk                   (0x20000000UL)            /*!< PORT14 OMR: PR13 (Bitfield-Mask: 0x01)                      */
#define PORT14_OMR_PR14_Pos                   (30UL)                    /*!< PORT14 OMR: PR14 (Bit 30)                                   */
#define PORT14_OMR_PR14_Msk                   (0x40000000UL)            /*!< PORT14 OMR: PR14 (Bitfield-Mask: 0x01)                      */
#define PORT14_OMR_PR15_Pos                   (31UL)                    /*!< PORT14 OMR: PR15 (Bit 31)                                   */
#define PORT14_OMR_PR15_Msk                   (0x80000000UL)            /*!< PORT14 OMR: PR15 (Bitfield-Mask: 0x01)                      */

/* --------------------------------  PORT14_IOCR0  -------------------------------- */
#define PORT14_IOCR0_PC0_Pos                  (3UL)                     /*!< PORT14 IOCR0: PC0 (Bit 3)                                   */
#define PORT14_IOCR0_PC0_Msk                  (0xf8UL)                  /*!< PORT14 IOCR0: PC0 (Bitfield-Mask: 0x1f)                     */
#define PORT14_IOCR0_PC1_Pos                  (11UL)                    /*!< PORT14 IOCR0: PC1 (Bit 11)                                  */
#define PORT14_IOCR0_PC1_Msk                  (0xf800UL)                /*!< PORT14 IOCR0: PC1 (Bitfield-Mask: 0x1f)                     */
#define PORT14_IOCR0_PC2_Pos                  (19UL)                    /*!< PORT14 IOCR0: PC2 (Bit 19)                                  */
#define PORT14_IOCR0_PC2_Msk                  (0xf80000UL)              /*!< PORT14 IOCR0: PC2 (Bitfield-Mask: 0x1f)                     */
#define PORT14_IOCR0_PC3_Pos                  (27UL)                    /*!< PORT14 IOCR0: PC3 (Bit 27)                                  */
#define PORT14_IOCR0_PC3_Msk                  (0xf8000000UL)            /*!< PORT14 IOCR0: PC3 (Bitfield-Mask: 0x1f)                     */

/* --------------------------------  PORT14_IOCR4  -------------------------------- */
#define PORT14_IOCR4_PC4_Pos                  (3UL)                     /*!< PORT14 IOCR4: PC4 (Bit 3)                                   */
#define PORT14_IOCR4_PC4_Msk                  (0xf8UL)                  /*!< PORT14 IOCR4: PC4 (Bitfield-Mask: 0x1f)                     */
#define PORT14_IOCR4_PC5_Pos                  (11UL)                    /*!< PORT14 IOCR4: PC5 (Bit 11)                                  */
#define PORT14_IOCR4_PC5_Msk                  (0xf800UL)                /*!< PORT14 IOCR4: PC5 (Bitfield-Mask: 0x1f)                     */
#define PORT14_IOCR4_PC6_Pos                  (19UL)                    /*!< PORT14 IOCR4: PC6 (Bit 19)                                  */
#define PORT14_IOCR4_PC6_Msk                  (0xf80000UL)              /*!< PORT14 IOCR4: PC6 (Bitfield-Mask: 0x1f)                     */
#define PORT14_IOCR4_PC7_Pos                  (27UL)                    /*!< PORT14 IOCR4: PC7 (Bit 27)                                  */
#define PORT14_IOCR4_PC7_Msk                  (0xf8000000UL)            /*!< PORT14 IOCR4: PC7 (Bitfield-Mask: 0x1f)                     */

